-- phpMyAdmin SQL Dump
-- version 4.0.9
-- http://www.phpmyadmin.net
--
-- Φιλοξενητής: 127.0.0.1
-- Χρόνος δημιουργίας: 20 Φεβ 2015 στις 13:37:21
-- Έκδοση διακομιστή: 5.5.34
-- Έκδοση PHP: 5.4.22

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Βάση: `consensus_rm`
--

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `world_erf_ga8`
--

CREATE TABLE IF NOT EXISTS `world_erf_ga8` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `P_ID` int(11) NOT NULL,
  `distance` double DEFAULT NULL,
  `dominatedbycategory` int(30) DEFAULT NULL,
  `dominatedbypool` int(30) DEFAULT NULL,
  `rank` int(30) DEFAULT NULL,
  `myorder` varchar(12) DEFAULT NULL,
  `chosen` int(30) DEFAULT '0',
  `liked` int(30) DEFAULT '0',
  `objscore` int(30) DEFAULT NULL,
  `prefscore` int(30) DEFAULT NULL,
  PRIMARY KEY (`ID`),
  KEY `P_ID` (`P_ID`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=41 ;

--
-- Άδειασμα δεδομένων του πίνακα `world_erf_ga8`
--

INSERT INTO `world_erf_ga8` (`ID`, `P_ID`, `distance`, `dominatedbycategory`, `dominatedbypool`, `rank`, `myorder`, `chosen`, `liked`, `objscore`, `prefscore`) VALUES
(1, 40, 5.6751, 0, 0, 1, '534511', 0, 0, 500, 0),
(2, 39, 5.6751, 0, 0, 1, '534511', 0, 0, 500, 0),
(3, 28, 4.4966, 0, 0, 1, '111161', 0, 0, 500, 0),
(4, 27, 4.4966, 0, 0, 1, '111161', 0, 0, 500, 0),
(5, 24, 5.021, 0, 0, 1, '325361', 0, 0, 500, 0),
(6, 23, 5.021, 0, 0, 1, '325361', 0, 0, 500, 0),
(7, 22, 4.4966, 0, 0, 1, '111161', 0, 0, 500, 0),
(8, 21, 4.4966, 0, 0, 1, '111161', 0, 0, 500, 0),
(9, 38, 5.675, 0, 2, 2, '436411', 0, 0, 466, 0),
(10, 37, 5.675, 0, 2, 2, '436411', 0, 0, 466, 0),
(11, 30, 5.0208, 0, 2, 2, '432461', 0, 0, 466, 0),
(12, 29, 5.0208, 0, 2, 2, '432461', 0, 0, 466, 0),
(13, 26, 5.675, 2, 4, 3, '436411', 0, 0, 422, 0),
(14, 25, 5.675, 2, 4, 3, '436411', 0, 0, 422, 0),
(15, 36, 5.6749, 2, 6, 4, '534511', 0, 0, 388, 0),
(16, 35, 5.6749, 2, 6, 4, '534511', 0, 0, 388, 0),
(17, 34, 5.6748, 0, 8, 5, '365311', 0, 0, 355, 0),
(18, 33, 5.6748, 0, 8, 5, '365311', 0, 0, 355, 0),
(19, 32, 5.6747, 4, 10, 6, '534511', 0, 0, 311, 0),
(20, 31, 5.6747, 4, 10, 6, '534511', 0, 0, 311, 0),
(21, 20, 5.6614, 0, 12, 7, '463411', 0, 0, 277, 0),
(22, 19, 5.6614, 0, 12, 7, '463411', 0, 0, 277, 0),
(23, 18, 5.6614, 2, 14, 8, '365311', 0, 0, 233, 0),
(24, 17, 5.6614, 2, 14, 8, '365311', 0, 0, 233, 0),
(25, 4, 5.0053, 0, 16, 7, '534521', 0, 0, 200, 0),
(26, 3, 5.0053, 0, 16, 7, '534521', 0, 0, 200, 0),
(27, 6, 5.6614, 2, 16, 9, '463411', 0, 0, 166, 0),
(28, 5, 5.6614, 2, 16, 9, '463411', 0, 0, 166, 0),
(29, 9, 5.0052, 0, 18, 8, '463421', 0, 0, 133, 0),
(30, 10, 5.0052, 0, 18, 8, '463421', 0, 0, 133, 0),
(31, 16, 5.6614, 6, 18, 10, '534511', 0, 0, 100, 0),
(32, 15, 5.6614, 6, 18, 10, '534511', 0, 0, 100, 0),
(33, 8, 4.4783, 0, 20, 7, '352361', 0, 0, 66, 0),
(34, 7, 4.4783, 0, 20, 7, '352361', 0, 0, 66, 0),
(35, 2, 4.4783, 0, 20, 7, '352361', 0, 0, 66, 0),
(36, 1, 4.4783, 0, 20, 7, '352361', 0, 0, 66, 0),
(37, 14, 5.6613, 4, 20, 11, '463411', 0, 0, 33, 0),
(38, 13, 5.6613, 4, 20, 11, '463411', 0, 0, 33, 0),
(39, 12, 5.6613, 0, 22, 12, '333311', 0, 0, 0, 0),
(40, 11, 5.6613, 0, 22, 12, '333311', 0, 0, 0, 0);

--
-- Περιορισμοί για άχρηστους πίνακες
--

--
-- Περιορισμοί για πίνακα `world_erf_ga8`
--
ALTER TABLE `world_erf_ga8`
  ADD CONSTRAINT `world_erf_ga8_ibfk_1` FOREIGN KEY (`P_ID`) REFERENCES `world_erf` (`ID`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
